app/controllers/directories_controller.rb

  def index
    @directories = Directory.all
---
SELECT "directories".* FROM "directories"

  def show
    @directory = Directory.find(params[:id])
---
SELECT "directories".* FROM "directories" WHERE ("directories"."id" = 1) LIMIT 1

  def directory_ajax
    @directory = Directory.find(params[:id])
---
SELECT "directories".* FROM "directories" WHERE ("directories"."id" = 1) LIMIT 1

  def directory_bb
    @directory = Directory.find(params[:id])
---
SELECT "directories".* FROM "directories" WHERE ("directories"."id" = 1) LIMIT 1

  def edit
    @directory = Directory.find(params[:id])
---
SELECT "directories".* FROM "directories" WHERE ("directories"."id" = 3) LIMIT 1

  def create
    @directory = Directory.new(params[:directory])

    respond_to do |format|
      if @directory.save
---
INSERT INTO "directories" ("created_at", "date", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "metadata", "name", "subtitle", "text", "updated_at") VALUES ('2010-10-19 08:52:02.618912', '2010-01-01', 'image/jpeg', '01.jpg', 298754, '2010-10-19 08:52:00.732081', 'demo meta data here', 'demo name', 'demo subtitle', 'demo text here', '2010-10-19 08:52:02.618912')

  def update
    @directory = Directory.find(params[:id])

    respond_to do |format|
      if @directory.update_attributes(params[:directory])
---
SELECT "directories".* FROM "directories" WHERE ("directories"."id" = 3) LIMIT 1
UPDATE "directories" SET "image_content_type" = 'image/jpeg', "image_file_name" = 'SURFACE.jpg', "image_file_size" = 531486, "image_updated_at" = '2010-10-19 20:01:54.659741', "updated_at" = '2010-10-19 20:01:55.135762' WHERE ("directories"."id" = 3)

  def destroy
    @directory = Directory.find(params[:id])
    @directory.destroy
---
SELECT "directories".* FROM "directories" WHERE ("directories"."id" = 1) LIMIT 1
DELETE FROM "directories" WHERE ("directories"."id" = 1)