app/controllers/galleries_controller.rb

SELECT "galleries".* FROM "galleries"
---
  def index
    @galleries = Gallery.all.reverse

SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 1) LIMIT 1
SELECT "gallery_items".* FROM "gallery_items" WHERE ("gallery_items".gallery_id = 1)
---
  def show
    @gallery = Gallery.find(params[:id])

    respond_to do |format|
      format.html # show.html.erb
      format.xml do
        # @galleries
        result= Array.new
        @gallery.gallery_items.each do |item|

SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 1) LIMIT 1
---
  def gallery_ajax
    @gallery = Gallery.find(params[:id])

SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 1) LIMIT 1
---
  def edit
    @gallery = Gallery.find(params[:id])

INSERT INTO "galleries" ("created_at", "date", "title", "updated_at") VALUES ('2010-10-04 20:14:46.948971', '2010-10-04', 'THANN', '2010-10-04 20:14:46.948971')
---
  def create
    @gallery = Gallery.new(params[:gallery])

    respond_to do |format|
      if @gallery.save

SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 9) LIMIT 1
---
  def update
    @gallery = Gallery.find(params[:id])

SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 7) LIMIT 1
DELETE FROM "galleries" WHERE ("galleries"."id" = 7)
---
  def destroy
    @gallery = Gallery.find(params[:id])
    @gallery.destroy