app/controllers/gallery_items_controller.rb

SELECT "gallery_items".* FROM "gallery_items"
---
  def index
    @gallery_items = GalleryItem.all

SELECT "gallery_items".* FROM "gallery_items" WHERE ("gallery_items"."id" = 1) LIMIT 1
---
  def show
    @gallery_item = GalleryItem.find(params[:id])

SELECT "gallery_items".* FROM "gallery_items" WHERE ("gallery_items"."id" = 1) LIMIT 1
---
  def edit
    @gallery_item = GalleryItem.find(params[:id])

INSERT INTO "gallery_items" ("created_at", "description", "gallery_id", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES ('2010-10-04 20:16:33.183137', 'บริเวณกลางร้านจัดวางโต๊ะใหญ่เพื่อไว้รองรับลูกค้าทั้งกลุ่มใหญ่และลูกค้าที่มาคนเดียว ตัวคอนเซ็ปต์้ร้านนั้นอิงกับการจำลองธรรมชาติผ่านวัสดุรีไซเคิล', 1, 'image/jpeg', '01.jpg', 1065514, '2010-10-04 20:16:31.479942', '2010-10-04 20:16:33.183137')
---
  def create
    @gallery_item = GalleryItem.new(params[:gallery_item])

    respond_to do |format|
      if @gallery_item.save

SELECT "gallery_items".* FROM "gallery_items" WHERE ("gallery_items"."id" = 1) LIMIT 1
UPDATE "gallery_items" SET "description" = '<b>THANN Boutique Café</b><br>บริเวณกลางร้านจัดวางโต๊ะใหญ่เพื่อไว้รองรับลูกค้าทั้งกลุ่มใหญ่และลูกค้าที่มาคนเดียว ตัวคอนเซ็ปต์้ร้านนั้นอิงกับการจำลองธรรมชาติผ่านวัสดุรีไซเคิล', "updated_at" = '2010-10-12 16:58:25.483064' WHERE ("gallery_items"."id" = 1)
---
  def update
    @gallery_item = GalleryItem.find(params[:id])

    respond_to do |format|
      if @gallery_item.update_attributes(params[:gallery_item])

SELECT "gallery_items".* FROM "gallery_items" WHERE ("gallery_items"."gallery_id" = 1)
---
  def filter
    @gallery_items = GalleryItem.where(:gallery_id =>params[:id])