app/controllers/news_controller.rb

SELECT "news".* FROM "news"
---
  def index
    @news = News.all.reverse

SELECT "news".* FROM "news" WHERE ("news"."id" = 2) LIMIT 1
---
  def show
    @news = News.find(params[:id])

SELECT "news".* FROM "news" WHERE ("news"."id" = 2) LIMIT 1
---
  def news_ajax
    @news = News.find(params[:id])

SELECT "news".* FROM "news" WHERE ("news"."id" = 2) LIMIT 1
---
  def news_bb
    @news = News.find(params[:id])

SELECT "news".* FROM "news" WHERE ("news"."id" = 3) LIMIT 1
---
  def edit
    @news = News.find(params[:id])

INSERT INTO "news" ("by", "caption", "created_at", "date", "metadata", "news_category_id", "news_content_type", "news_file_name", "news_file_size", "subtitle", "text", "title", "updated_at") VALUES ('', '', '2010-10-19 19:54:52.792491', NULL, '', 2, NULL, NULL, NULL, '', '', 'CURIOUS ORANGE', '2010-10-19 19:54:52.792491')
---
  def create
    @news = News.new(params[:news])

    respond_to do |format|
      if @news.save

SELECT "news".* FROM "news" WHERE ("news"."id" = 3) LIMIT 1
UPDATE "news" SET "text" = 'ระหว่างที่คนส่วนใหญ่ในโลกมัวแต่ลังเลว่าจะยอมให้อาชีพที่เก่าแก่ที่สุดนี้เป็นอาชีพถูกกฎหมายดีหรือไม่ และควรมี กฏระเบียบควบคุมหรือเปล่า ครีเอทีฟกลุ่มหนึ่งใน อัมสเตอร์ดัมกำลังง่วนอยู่กับการสร้างสถานบริการแห่ง อนาคต โปรเจ็กต์ 21st Century Bordello เป็นการ ร่วมมือกันของหลายๆ ฝ่าย นำโดยสถาปนิกจาก Concrete จัดแสดงควบคู่ไปกับ The Hoerengracht งาน อินสตอลเลชันเปิดประวัติศาสตร์ย่านโคมเขียวประจำ เมือง โดยศิลปินชาวอเมริกัน Edward และ Nancy Kienholz ซึ่งขณะนีจัดแสดงอยู่ที่พิพิธภัณฑ์ประวัติศาสตร์แห่งกรุงอัมสเตอร์ดัม โปรเจ็กต์ทดลองนี้ตั้งอยู่ในสถานบริการที่อยู่ไม่ไกลออกไปและมีฟังก์ชันกำแพงโค้งที่มีแสงเรืองรอง อ่างล้างหน้า เวิ้งเอาไว้เก็บของเล่น ทิชชู่และถุงยาง เพดานกระจก และเตียงนอนเล่นทรงกลม รวมทั้งมีวีดีโอและรูปภาพยั่วยวนฉายบนกำแพงด้านหลัง', "updated_at" = '2010-10-20 00:56:24.641902' WHERE ("news"."id" = 5)
---
  def update
    @news = News.find(params[:id])

    respond_to do |format|
      if @news.update_attributes(params[:news])