app/views/galleries/show_ajax.html.erb

          <% index = 0 %>
          <% @gallery.gallery_items.each do |item| %>
---
SELECT "gallery_items".* FROM "gallery_items" WHERE ("gallery_items".gallery_id = 1)